
## Plan Result (prod_twingate)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 2 to change, 3 to destroy.</code></pre>

* Create
  * time_rotating.service_account_key_rotation
  * twingate_resource.this[&#34;banceylab-tiny-pve&#34;]
* Update
  * azurerm_key_vault_secret.service_account_key[&#34;AzureDevOps&#34;]
  * azurerm_key_vault_secret.service_account_key[&#34;Pterodactyl&#34;]
* Replace
  * time_static.service_account_key_rotation


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.service_account_key["AzureDevOps"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "service_account_key" {
        id                      = "https://bancey-vault.vault.azure.net/secrets/Twingate-AzureDevOps-SA-Key/3393e612b9a94906a43c187e60cc82cc"
        name                    = "Twingate-AzureDevOps-SA-Key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.service_account_key["Pterodactyl"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "service_account_key" {
        id                      = "https://bancey-vault.vault.azure.net/secrets/Twingate-Pterodactyl-SA-Key/f4da8b05657b47a9a24241ed71d8097a"
        name                    = "Twingate-Pterodactyl-SA-Key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # time_rotating.service_account_key_rotation will be created
  + resource "time_rotating" "service_account_key_rotation" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 7
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # time_static.service_account_key_rotation must be replaced
-/+ resource "time_static" "service_account_key_rotation" {
      ~ day     = 6 -> (known after apply)
      ~ hour    = 8 -> (known after apply)
      ~ id      = "2024-08-06T08:16:12Z" -> (known after apply)
      ~ minute  = 16 -> (known after apply)
      ~ month   = 8 -> (known after apply)
      ~ rfc3339 = "2024-08-06T08:16:12Z" # forces replacement -> (known after apply) # forces replacement
      ~ second  = 12 -> (known after apply)
      ~ unix    = 1722932172 -> (known after apply)
      ~ year    = 2024 -> (known after apply)
    }

  # twingate_resource.this["banceylab-tiny-pve"] will be created
  + resource "twingate_resource" "this" {
      + address                     = "10.151.14.4"
      + alias                       = "tiny-pve.heimelska.co.uk"
      + id                          = (known after apply)
      + is_active                   = true
      + is_authoritative            = (known after apply)
      + is_browser_shortcut_enabled = false
      + is_visible                  = true
      + name                        = "tiny-pve"
      + protocols                   = {
          + allow_icmp = false
          + tcp        = {
              + policy = "RESTRICTED"
              + ports  = [
                  + "443",
                ]
            }
          + udp        = {
              + policy = "DENY_ALL"
              + ports  = []
            }
        }
      + remote_network_id           = "UmVtb3RlTmV0d29yazo5OTIzOA=="
      + security_policy_id          = "U2VjdXJpdHlQb2xpY3k6MzE2OTYy"

      + access_group {
          + group_id           = "R3JvdXA6MjE2NzU3"
          + security_policy_id = "U2VjdXJpdHlQb2xpY3k6MzE2OTYy"
        }
      + access_group {
          + group_id           = "R3JvdXA6MjE2NzU4"
          + security_policy_id = "U2VjdXJpdHlQb2xpY3k6MzE2OTYy"
        }

      + access_service {
          + service_account_id = "U2VydmljZUFjY291bnQ6YmNkYjZkYjMtNTIxNC00ZjQxLWI0YjQtMzMyZmI5MTYyZjEz"
        }
    }

  # twingate_service_account_key.this["AzureDevOps"] will be replaced due to changes in replace_triggered_by
-/+ resource "twingate_service_account_key" "this" {
      ~ id                 = "U2VydmljZUFjY291bnRLZXk6QnB2OWR6Y2JpZjRPaUtidVlsb0JQcGJUbHdTZmZHcjU5bDEzbDRlczJkYw==" -> (known after apply)
      ~ is_active          = true -> (known after apply)
        name               = "AzureDevOps Key (auto rotates)"
      ~ token              = (sensitive value)
        # (2 unchanged attributes hidden)
    }

  # twingate_service_account_key.this["Pterodactyl"] will be replaced due to changes in replace_triggered_by
-/+ resource "twingate_service_account_key" "this" {
      ~ id                 = "U2VydmljZUFjY291bnRLZXk6R0RjdTlSb1RjZzZmSkctbV9pNGFLTUlPWUc5MHRnVmY2TjB4QU04MlhwYw==" -> (known after apply)
      ~ is_active          = true -> (known after apply)
        name               = "Pterodactyl Key (auto rotates)"
      ~ token              = (sensitive value)
        # (2 unchanged attributes hidden)
    }

Plan: 5 to add, 2 to change, 3 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # time_rotating.service_account_key_rotation has been deleted
  - resource "time_rotating" "service_account_key_rotation" {
        id               = "2024-08-06T08:16:12Z"
      - rfc3339          = "2024-08-06T08:16:12Z" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":246,"Program":"tfcmt","SHA1":"","Target":"prod_twingate","Vars":{}} -->